[
  {
    "id": "1",
    "slug": "customer-churn-prediction",
    "title": "Customer Churn Prediction Model",
    "summary": "Machine learning model predicting customer churn with 92% accuracy for telecom industry",
    "description": "Developed a predictive model using ensemble methods (Random Forest, XGBoost) to identify customers at risk of churning. Performed extensive feature engineering, handled class imbalance using SMOTE, and implemented cross-validation for robust performance. Created interactive dashboards for business stakeholders to monitor churn risk scores and identify key retention factors. Model achieved 92% accuracy and 0.89 AUC-ROC score.",
    "tags": ["Python", "Scikit-learn", "XGBoost", "Tableau"],
    "image": "/placeholder-project.jpg",
    "githubUrl": "https://github.com/yourusername/churn-prediction",
    "liveUrl": "https://churn-dashboard.example.com",
    "published": true,
    "featured": true,
    "completedAt": "2025-12-15"
  },
  {
    "id": "2",
    "slug": "sales-forecasting-time-series",
    "title": "Sales Forecasting System",
    "summary": "Time series analysis and forecasting for retail sales with seasonality detection",
    "description": "Built a comprehensive sales forecasting system using ARIMA, SARIMA, and Prophet models to predict monthly sales across multiple product categories. Analyzed 5+ years of historical data, identified seasonal patterns and trends, and incorporated external factors like holidays and promotions. Implemented automated model selection and retraining pipeline. Forecasts improved inventory planning and reduced stockouts by 35%.",
    "tags": ["Python", "Prophet", "Pandas", "Power BI"],
    "image": "/placeholder-project.jpg",
    "githubUrl": "https://github.com/yourusername/sales-forecasting",
    "liveUrl": "https://sales-forecast.example.com",
    "published": true,
    "featured": true,
    "completedAt": "2025-10-20"
  },
  {
    "id": "3",
    "slug": "sentiment-analysis-nlp",
    "title": "Social Media Sentiment Analysis",
    "summary": "NLP-powered sentiment analysis of product reviews and social media mentions",
    "description": "Developed a natural language processing pipeline to analyze customer sentiment from product reviews and social media. Implemented BERT-based transformer models for sentiment classification, achieving 88% accuracy. Created real-time monitoring dashboard tracking sentiment trends, identifying emerging issues, and extracting key themes. Processed over 500K+ reviews and social mentions to provide actionable insights for product and marketing teams.",
    "tags": ["Python", "BERT", "NLTK", "Streamlit"],
    "image": "/placeholder-project.jpg",
    "githubUrl": "https://github.com/yourusername/sentiment-analysis",
    "liveUrl": "https://sentiment-demo.example.com",
    "published": true,
    "featured": false,
    "completedAt": "2025-09-05"
  },
  {
    "id": "4",
    "slug": "healthcare-analytics-dashboard",
    "title": "Healthcare Analytics Dashboard",
    "summary": "Interactive dashboard analyzing patient outcomes and hospital operational metrics",
    "description": "Designed and built a comprehensive analytics dashboard for healthcare providers to track patient outcomes, readmission rates, and operational efficiency. Integrated data from multiple sources (EHR systems, billing, scheduling), performed data cleaning and transformation using Python. Implemented predictive models for patient readmission risk. Dashboard enables real-time monitoring of KPIs and supports data-driven decisions to improve patient care quality.",
    "tags": ["Python", "SQL", "Tableau", "Pandas"],
    "image": "/placeholder-project.jpg",
    "githubUrl": "https://github.com/yourusername/healthcare-analytics",
    "liveUrl": "https://healthcare-dashboard.example.com",
    "published": true,
    "featured": true,
    "completedAt": "2025-11-30"
  },
  {
    "id": "5",
    "slug": "credit-risk-assessment",
    "title": "Credit Risk Assessment Model",
    "summary": "Machine learning system for loan default prediction and credit scoring",
    "description": "Built a robust credit risk assessment model using logistic regression, decision trees, and neural networks to predict loan default probability. Performed thorough exploratory data analysis on 100K+ loan applications, handled missing data, and created meaningful financial ratios as features. Implemented SHAP values for model interpretability to meet regulatory requirements. Model achieved 85% accuracy and is used to automate credit approval decisions.",
    "tags": ["Python", "TensorFlow", "Scikit-learn", "SHAP"],
    "image": "/placeholder-project.jpg",
    "githubUrl": "https://github.com/yourusername/credit-risk",
    "liveUrl": "https://credit-model.example.com",
    "published": true,
    "featured": false,
    "completedAt": "2025-08-12"
  },
  {
    "id": "6",
    "slug": "ab-testing-framework",
    "title": "A/B Testing Statistical Framework",
    "summary": "Statistical analysis framework for A/B testing with automated reporting",
    "description": "Developed a comprehensive A/B testing framework for e-commerce experimentation. Implemented statistical tests (t-tests, chi-square, Mann-Whitney) with proper sample size calculations and power analysis. Created automated reporting system that generates insights on conversion rates, revenue impact, and statistical significance. Includes Bayesian A/B testing methods and sequential testing capabilities. Framework has been used to evaluate 50+ experiments, driving data-informed product decisions.",
    "tags": ["Python", "R", "Statistics", "Matplotlib"],
    "image": "/placeholder-project.jpg",
    "githubUrl": "https://github.com/yourusername/ab-testing",
    "liveUrl": "https://ab-testing.example.com",
    "published": true,
    "featured": false,
    "completedAt": "2025-07-25"
  }
]
